Revit 2027 API
AssetPropertyList.AddNewAssetPropertyDouble Method
 Adds a new AssetPropertyDouble containing the input value to this list.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public void AddNewAssetPropertyDouble(
	double value
)
Public Sub AddNewAssetPropertyDouble (
	value As Double
)
public:
void AddNewAssetPropertyDouble(
	double value
)
member AddNewAssetPropertyDouble :
        value : float -> unit
Parameters
value Double
 The double value to add.
Exceptions
Exception | Condition
InvalidOperationException |  The asset property is not editable.
See Also
Reference
AssetPropertyList Class
Autodesk.Revit.DB.Visual Namespace